package A_supplementary_class;
/**
 * 같은 타입의 여러 변수를 하나의 묶음으로 다룬ㄴ 가장 일반적인 구조
 * 많은 양의 값(데이터)을 다룰 때 유용함
 * 배열의 각 요소는 순서를 가지며 서로 연속적임
 * 타입 변수이름[] or 타입[] 변수이름 --> 자바에서 많이 이용
 * int[] score = {100, 90, 80, 70, 60};
 * int[] score;
 * score = new int[]{100, 90, 80, 70, 60};
 **/

public class Array {
    public static void main(String[] args) {
        int[] arr = new int[4];

        arr[0] = 1;
        arr[1] = 2;
        arr[2] = 3;
        arr[3] = 4;

        System.out.println(arr[0] * 2);
        System.out.println(arr[1] * 2);
        System.out.println(arr[2] * 2);
        System.out.println(arr[3] * 2);
/*****************************************************************************************************************************************************************************************************/

        int[] arr_2 = new int[4];
        for(int i = 0; i < arr_2.length; i++){
            arr[i] = i + 1;
            System.out.println(arr[i] * 2);
        }
/***************************************************************************************************************************************************************************************************/
        /**
         * 다차원 배열
         *  int[][]
         *  **/
/***********************************************************************************************************************************************************/
        int[] arr_3 = new int[4];

        for(int i = 0; i <4; i++){
            arr[i] = i + 1;
        }
        int sum = 0;
        float avg = 0;


        // arr_3에 들어있는 값이 몇개인지는 모르겠으나 arr에 들어있는 값을 순차적으로 하나씩 i에 담는다
        // i : 자료구조 --> i의 타입과 자료구조가 담고있는 데이터 타입이 동일해야한다.
        for(int i : arr_3){
            sum += i;
        }

        avg = sum / (float)arr_3.length;
        System.out.println("arr_3의 평균 : " +avg);

/*******************************************************************************************************************************************************************/
        int[] arr_4 = {10,20,30,40,50,60};

        int max = 0;
        int maxIdx = 0;
        for(int i = 0; i < arr_4.length; i++){
            if(max < arr_4[i]){
                max = arr_4[i];
                maxIdx = i;
            }
            System.out.println("일반 for문" + max + "    "+maxIdx);
        }
        max = 0;
        maxIdx = 0;
        for(int i : arr_4){
            if(max < i){
                max = i;
            }
            System.out.println("향상된 for문" + max );
        }
/******************************************************************************************************************************/
    }

}
